# -------------โปรแกรมคํานวณราคาตั๋วคําชมพิพิธภัณฑ์--------------- 

#พิพิธภัณฑ์แห่งหนึ่งกําหนดราคาตั๋วเข้าชมสําหรับผู้ใหญ่ 100 บาท สําหรับเด็ก 50 บาท 
#โดยให้ส่วนลดพิเศษสําหรับเดือนนี้ ดังนี้

''' -กรณีที่ลูกค้าเป็นสมาชิกของพิพิธภัณฑ์ และได้ซื้อตั๋วเด็กร่วมด้วย
       -ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 10 ใบขึ้นไป จะได้ส่วนลด 50% ทุกที่นั่ง
       -ถ้าซื้อตั๋วรวมทั้งหมดตั้งแต่ 5 ใบขึ้นไป จะได้ส่วนลด 30% ทุกที่นั่ง
       -ถ้าซื้อตั๋วรวมทั้งหมดไม่ถึง 5 ใบจะได้ส่วนลด 20% ทุกที่นั่ง
    
    -กรณีที่ลูกค้าเป็นสมาชิกพิพิธภัณฑ์ และไม่ซื้อตั๋วเด็ก จะได้ส่วนลด 10% ทุกที่นั่ง

    -กรณีที่ลูกค้าไม่เป็นสมาชิก จะได้ส่วนลด 5% ทุกที่นั่ง
'''

man = int(input("จํานวนตั๋วผู้ใหญ่ ="))
children = int(input("จํานวนตั๋วเด็ก ="))

member = input("ท่านเป็นสมาชิกหรือไม่ ? : ") #พิมพ์ Y เพื่อตอบว่าเป็นสมาชิก หรือ พิมพ์ N เพื่อตอบว่าไม่ได้เป็นสมาชิก

if member=="Y" and children != 0 :
    #ซื้อบัตร 10 ใบขึ้นไปจะได้ส่วนลด 50%
        if man+children >= 10 :
            print("สําหรับสมาชิกที่ซื้อบัตร เด็ก และซื้อตั๋วตั้งแต่ 10 ใบขึ้นไป ลด 50% ทุกที่นั่ง")
            price = 0.5*((100*man)+(50*children))
    #ซื้อบัตร 5 ใบขึ้นไปจะได้ส่วนลด 30%    
        elif man+children >= 5 :
            print("สําหรับสมาชิกที่ซื้อบัตร เด็ก และซื้อตั๋วตั้งแต่ 5 ใบขึ้นไป ลด 30% ทุกที่นั่ง")
            price = 0.7*((100*man)+(50*children))
    #ซื้อบัตรไม่ถึง 5 ใบไปจะได้ส่วนลด 20%  
        else :
            print("สําหรับสมาชิกที่ซื้อบัตร เด็ก และซื้อตั๋วไม่ถึง 5 ใบ ลด 20% ทุกที่นั่ง")
            price = 0.8*((100*man)+(50*children))
#กรณีเป็นสมาชิก และไม่ซื้อบัตร เด็ก จะได้ส่วนลด 10%
elif member=="Y" and children == 0 :
        print("สําหรับสมาชิกที่ไม่ได้ซื้อบัตร เด็ก ลด 10% ทุกที่นั่ง")
        price = 0.9*(100*man)
#กรณีไม่เป็นสมาชิก จะได้ส่วนลด 5%
elif member == "N" :
    print("ลูกค้าที่ไม่ได้เป็นสมาชิกลด 5% ทุกที่นั่ง")
    price = 0.95*((100*man)+(50*children))
else :
    print("ไม่สามารถระบุได้ว่าลูกค้าเป็นสมาชิกหรือไม่ จึงไม่สามารถคํานวณราคาตั๋วได้")    

print("----------ใบเสร็จ----------")
print("คุณได้ซื้อตั๋วผู้ใหญ่ : ",man,"ใบ")
print("คุณได้ซื้อตั๋วผู้เด็ก  : ",children,"ใบ")
print("Total :",price," Bath")
print("---------ขอบคุณที่ใช้บริการ--------")                    







