#โครงสร้างควบคุมการทําซํ้า

#for loop


# for i in range(start,stop,step) #กําหนดรอบการทํางาน 
#start คือ ให้เริ่มรอบที่เท่าไหร่ stop คือ ให้จบรอบที่เท่าไหร่ step คือ ให้ทํางานแต่ละรอบเพิ่มค่า หรือ ลดค่าลงเท่าไหร่ ก็จะเก็บลงไปที่ตัวแปร i ที่เป็นตัวนับรอบ

#ใช้ for loop เขียนhello world 3 รอบ

for i in range(3) :#เริ่มทํางานจาก 0 จนจบที่ก่อนถึง 3
    print("Hello world รอบที่ :",i)#0,1,2

print("----------------------------------------------------------------------------------")

for i in range(1,4) : #ใช้ for loop เขียนhello world 3 รอบ เหมือนกันแต่คราวนี้กําหนดรอบ การทํางานจาก 1 จบจบที่ก่อนถึง 4
    print("Hello world รอบที่ :",i )#1,2,3

print("----------------------------------------------------------------------------------")
for i in range(1,4,2): #คราวนี้ได้ใช้ step(เลข 2 นั่นแหละ) จะทําให้เพิ่มทีละ บวก2 
    print("Hello world รอบที่ :",i)#1,3

print("-----------------------------------------------------------------------------")

#ใช้for loop หาผลบวกของ 1+2+3+....10

sum = 0

for i in range (1,101) :
    sum += i

print("ค่าของ 1+2+3+....10 = ",sum)    






