#โครงสร้างควบคุมการทําซํ้า

# while
'''    

while expression :
    statement

'''
#i=1 #ตัวนับจํานวนรอบ

#while i<=3 : 
#    print("Hello world",i)
#    i=i+1 

#หาผลรวมตัวเลขโดยใช้ while loop
#หา 1+2+3+....+100

'''
i = 1 #ตัวนับจํานวนรอบ
sum = 0 #เก็บผลบวกเลขตามจํานวน

while i<=100 :
    sum = sum + i #เก็บผลรวมของ i แต่ละรอบ
    i = i+1
print(" 1+2+3+....+100 = ",sum)    

'''


i=1 #ตัวนับจํานวนรอบ
sum = 0 #เก็บผลบวกเลขตามจํานวน
while i<=100 :
    sum = sum + i*i #เก็บผลรวมของ i แต่ละรอบ
    i = i+1
print("1*1+2*2+3*3+...+100*100 = ",sum)    