#ตัวดําเนินการทางคณิตศาสตร์

#ตัวดําเนินการ & ตัวที่ถูกดําเนินการ
#Operator |   Operand

#x = 10
#y = 4 

#print("ผลบวก ", x+y )
#print("ผลลบ ",x-y )
#print("ผลคูณ ",x*y )
#print("ผลหาร ",x/y )
#print("หารปัดเศษ",x//y )
#print("เลขยกกําลัง", x**y)
#print("หารเอาเศษ", x%y)

print("----------------------------------------------")

#ตัวดําเนินการทางตรรกศาสตร์
# AND = และ
#OR = หรือ
#NOT = ไม่

#คําตอบที่ได้ => จริง / เท็จ
x=(5<=10) # ค่า x = boolean เป็น True
y=(10==5) # ค่า y = boolean เป็น False

z = x or y
print(z) # ได้เป็น ค่า boolean 0kd True or False ได้ True


o = (5+2)*10
print(o)