name = 'timeworachote' #การเข้าถึงตัวอักษรในString
print(name[0:5]) #จบที่ก่อนถึงจุดสุดท้าย 
print(name[:13]) #ให้จาก [0] ถึงที่ตัวก่อน [13]

year = 'time : 40'
print("คุณ Time มีอายุ "+year[7:9]+" ปี") # output คือ คุณ Time มีอายุ 40 ปี 
print("--------------------------------------------")
print("คุณ Time มีอายุ "+year[-2:]+" ปี") #นับจากขวาสุดเรื่มที่ -1 กรณีของอันนี้คือ เรื่มที่ ตัวที่ 2 นับจากขวาสุดเป็นต้นไปจนจบคํา output คือ คุณ Time มีอายุ 40 ปี 

#การใช้ len function หาความยาว string
'''
name2 = 'Worachote'
print(len(name2)) # ได้ output คือ 8

'''
'''
#ใช้ strip() เพื่อลบช่องว่างซ้ายขวาออก
name3 ="  Time  "
print(len(name3)) #ได้ output คือ 8 เพราะ นอกจากคําว่า Time แล้วยังมีช่องว่างทางฝั่งซ้ายและขวาอีกฝั่งละ 2 ช่อง

name3 = name3.strip() #ใช้ strip() ลบช่องว่างซ้ายขวาแล้วเก็บลงไปที่ตัวแปร nmae อีกรอบนึง
print(len(name3)) # คราวนี้จะได้ output คือ 4

'''
'''
#แปลง case ของ String 
name4 = "kong" #พิมพ์เล็กหมดเลย
print(name4.upper()) #ใช้ uper() แปลงเป็นพิมพ์ใหญ่ทั้งหมด

name5 ="KONG" #พิมพ์ใหญ่หมดเลย
print(name5.lower()) #ใช้ lower() แปลงเป็นพิมพ์เล็กทั้งหมด

'''

'''
#replace เพื่อ เปลี่ยน Stringส่วนที่เลือก ให้ เป็นคําที่ต้องการ
# replace('คําเดิม','คําที่ต้องการจะเปลี่ยน')

name6 = "Worachote"

print(name6.replace("chote","5555555555"))

'''
# นับจํานวนคําในประโยคใช้ count

fruit = "ไปซื้อ ผลไม้ ที่ตลาด มี ทุเรียน มังคุด ข้าวเหนียว ทุเรียน และคุกกี้รสทุเรียน"
print(fruit.count("ทุเรียน"))