print("-------- โปรแกรมแปลงอุณหภูมิ --------")
# ใช้เรื่อง ตัวดําเนินการทางคณิตศาสตร์ และ การใช้ String

temp = input("ป้อนอุณหภูมิ(องศา) : ") #สมมติว่าจะป้อน 45C ลงไป

degree = int(temp[:-1]) #ตัวแปร degree เก็บค่าตั้งแต่คําแรก จนเกือบถึงตัวสุดท้าย (ตัวสุดท้ายก็คือหน่วยนั่นแหละ!! เราแค่ต้องการ แยกหน่วยออกจากเลข) 
unit = temp[-1].upper() #เก้บหน่วยว่าเป็น C หรือ F และ มีการใช้ upper() เผื่อกรณีที่ผู้ใช้ พิมพ์ c พิมพ์เล็กเข้ามา

if unit == "C" :
    #แปลงเป็นฟาเรนไฮต์
    result = (degree*(9/5))+32
    result_unit = "ฟาเรนไฮต์"
    result_unit_char = "F"
        
if unit == "F" :
    #แปลงเป็นเซลเซียส    
    result = (degree-32)*5/9
    result_unit = "เซลเซียส"
    result_unit_char = "C"


print("แปลงค่า ",temp,"เป็น",result_unit," = ",result,result_unit_char)    
    










'''
#ถ้าผู้ใช้ป้อนหน่วย เซลเซียส ให้เปลี่ยนเป็น ฟาเรนไฮต์ แต่ ถ้าป้อนฟาเรนไฮต์ ให้เปลี่ยนเป็น เซลเซียส
if "C" :
    #แปลงเป็นฟาเรนไฮต์
    temp

if "F" :
    #แปลงเป็นเซลเซียส    
    pass
'''